Repository: rschwenn/Rstyx.LoggingConsole
Catalog: LoggingConsole/source/Cultures/Resources.*.resx
Languages: de

source: MessageStore initialized.
de: Nachrichtenpool initialisiert.

# MessageStore_LimitLogResult
source: *** Log limited: Old length = {0:0} lines, New length = {1:0} lines.
de: *** Protokoll gekürzt: Old length = {0:0} lines, New length = {1:0} lines.

# MessageStore_LogCleared
source: All Log Entries removed.
de: Alle Einträge gelöscht.

# LogBox_LogInitialized
source: Log initialized.
de: Protokoll initialisiert.

# Enum_Dock_Bottom
source: Bottom
de: Unten

# Enum_Dock_Left
source: Left
de: Links

# Enum_Dock_Right
source: Right
de: Rechts

# Enum_Dock_Top
source: Top
de: Oben

# Enum_LogLevel_Error
source: Error
de: Fehler

# Enum_LogLevel_Warning
source: Warning
de: Warnung

# LogBox_AboutBox_NotAllowedInBrowser
source: About LoggingConsole: Popup dialog is not allowed inside browser!
de: Info über LoggingConsole: Popup-Dialog ist innerhalb des Browsers nicht erlaubt!

# LogBox_ClearLogCommand_Caption
source: Clear Log
de: Protokoll löschen

# LogBox_ClearLogCommand_Description
source: Clear the whole Log
de: Löschen des gesamten Protokolls

# LogBox_DefaultDisplayName
source: Logging Console
de: Protokoll-Konsole

# LogBox_EmbedConsoleViewFailed
source: The Console View is already embedded in another Window. => Display in floating Window not possible!
de: Die Konsolenansicht ist bereits in ein anderes Fenster eingebettet => Anzeige im eingebauten Fenster ist nicht möglich!

# LogBox_HideFloatingConsoleViewCommand_Caption
source: Close
de: Schließen

# LogBox_HideFloatingConsoleViewCommand_Description
source: Close floating Console Window
de: Schließen des Protokoll-Fensters

# LogBox_ResetSettingsCommand_Caption
source: Reset Options
de: Optionen zurücksetzen

# LogBox_ResetSettingsCommand_Description
source: Reset User Settings to Defaults.
de: Benutzer-Einstellungen auf Vorgabewerte zurücksetzen

# LogBox_SaveLogCommand_Caption
source: Save Log
de: Protokoll speichern

# LogBox_SaveLogCommand_Description
source: Save the current Log View into a text File
de: Speichern der aktuellen Protokollansicht als Textdatei

# LogBox_SaveLogDialog_Aborted
source: SaveAs dialog aborted
de: Speichern-Dialog abgebrochen.

# LogBox_SaveLogDialog_FilenameReturned
source: SaveAs dialog returned filename '{0}'
de: Speichern-Dialog ergab Dateiname '{0}'

# LogBox_SaveLogDialog_Logfiles
source: Log Files
de: Logdateien

# LogBox_SaveLogDialog_Title
source: {0} Log save as ...
de: {0}-Protokoll speichern als ...

# LogBox_SaveLog_FinalErrorMessage
source: => Failed creating File '{0}'.
de: => Anlegen der Datei '{0}' ist gescheitert.

# LogBox_SaveLog_FinalSuccessMessage
source: {0} Log saved in File '{1}'
de: {0}-Protokoll gespeichert in Datei '{1}'

# LogBox_ShowFloatingConsoleViewCommand_Caption
source: Show Log
de: Protokoll zeigen

# LogBox_ShowFloatingConsoleViewCommand_Description
source: Show the Log in floating Window
de: Anzeigen des Protokolls im Fenster

# LogBox_ShowAboutBoxCommand_Caption
source: About
de: Info

# LogBox_ShowAboutBoxCommand_Description
source: Info about Logging Console
de: Info über Logging Console

# MessagesView_gvch_Date
source: Date
de: Datum

# MessagesView_gvch_Level
source: Level
de: Typ

# MessagesView_gvch_Message
source: Message
de: Nachricht

# MessagesView_gvch_SerialNo
source: Line No
de: lfd Nr

# MessagesView_gvch_Source
source: Source
de: Quelle

# MessagesView_gvch_Time
source: Time
de: Zeit

# ConsoleView_Appearence_Language
source: Language:
de: Sprache:

# ConsoleView_Appearence_TabPosition
source: Position of Tabs:
de: Lage der Tabs:

# ConsoleView_Appearence_OptionpanePosition
source: Position of Options:
de: Lage der Optionen:

# ConsoleView_Appearence_BackgroundColors
source: Background Colors
de: Hintergrundfarben

# ConsoleView_Appearence_BackgroundColors_ToolTip
source: Use different background colors
de: Verschiedene Hintergrundfarben verwenden

# ConsoleView_Appearence_ForegroundColors
source: Text Colors
de: Textfarben

# ConsoleView_Appearence_ForegroundColors_ToolTip
source: Use different text colors
de: Verschiedene Textfarben verwenden

# ConsoleView_Appearence_DarkColorSchema
source: Dark Color Schema
de: Dunkles Farbschema

# ConsoleView_Appearence_DarkColorSchema_ToolTip
source: Use dark background colors.
de: Dunkle Hintergrundfarben verwenden

# ConsoleView_Appearence_OwnFontSize
source: Font Size:
de: Schriftgröße:

# ConsoleView_Appearence_OwnFontSize_ToolTip
source: If disabled, the Font Size of the main window or system is used.
de: Wenn deaktiviert, wird die Schriftgröße des Hauptfensters bzw. des Systems verwendet.

# ConsoleView_Appearence_Toolbar
source: Toolbar
de: Symbolleiste

# ConsoleView_Appearence_Toolbar_ToolTip
source: Show tasks toolbar
de: Aufgaben-Symbolleiste anzeigen

# ConsoleView_Header_Tasks
source: Tasks
de: Aufgaben

# ConsoleView_Header_ColumnDisplay
source: Column Display
de: Spaltenanzeige

# ConsoleView_Header_Behavior
source: Behavior
de: Verhalten

# ConsoleView_Header_LogLength
source: Max. Log Length
de: Max. Protokolllänge

# ConsoleView_Header_Appearence_General
source: Appearence General
de: Erscheinung Allgemein

# ConsoleView_Header_Appearence_Textarea
source: Appearence Text Area
de: Erscheinung Textbereich

# ConsoleView_Tasks_LineNo
source: Line No
de: Zeile Nr

# ConsoleView_Tasks_Date
source: Date
de: Datum

# ConsoleView_Tasks_Time
source: Time
de: Zeit

# ConsoleView_Tasks_Level
source: Level
de: Typ

# ConsoleView_Tasks_Source
source: Source
de: Quelle

# ConsoleView_Behavior_ErrorPopup
source: Error Popup
de: Fehler-Popup

# ConsoleView_Behavior_ErrorPopup_ToolTip
source: Should the Console popup when new Errors are logged?
de: Soll die Konsole bei neuen Fehlern automatisch angezeigt werden?

# ConsoleView_Behavior_AutoColWidth
source: Auto Column Width
de: Auto-Spaltenbreite

# ConsoleView_Behavior_AutoColWidth_ToolTip
source: Set Column Width automatically to match the longest visible item
de: Spaltenbreite automatisch anhand des längsten, sichtbaren Eintrages festlegen

# ConsoleView_LogLength_Lines
source: Lines
de: Zeilen

# ConsoleView_LogLength_ToolTip
source: 0 = unlimited
de: 0 = unbegrenzt

# ConsoleView_Header_OptionPane
source: Log: Options and Tasks
de: Protokoll: Optionen und Aufgaben

# About_License
source: License:
de: Lizenz:

# About_ProgDescription
source: a .NET Logging Component
de: eine .NET Protokoll-Komponente

# Console_GetFontsize_ValueChanged
source: Change dangerous value ({0:F1}) to {1:F1}.
de: Unpraktikabler Wert ({0:F1}) wird geändert zu {1:F1}.

# Console_GetConsoleView_Created
source: New ConsoleView created.
de: Neuen ConsoleView erzeugt.

# Console_SetConsoleView_Connected
source: Existing ConsoleView connected.
de: Existierenden ConsoleView eingebunden.

# ConsoleView_Appearence_OwnFontFamily
source: Fixed Width Font
de: Festbreiten-Schrift

# ConsoleView_Appearence_OwnFontFamily_ToolTip
source: If disabled, the Font Family of the main window or system is used, otherwise a non-proportional font
de: Wenn deaktiviert, wird die Schriftart des Hauptfensters bzw. des Systems verwendet, sonst eine nicht proportionale Schrift.

# Global_ErrorInEventHandler
source: Error while handling an event
de: Fehler bei der Ereignisbehandlung

# Global_ErrorMaybeInEventHandler
source: Unexpected error (maybe while handling an event)
de: Unerwarteter Fehler (eventuell bei der Ereignisbehandlung)

# Global_UnexpectedError
source: Unexpected error.
de: Unerwarteter Fehler.

# Global_UnexpectedErrorIn
source: Unexpected error in {0}().
de: Unerwarteter Fehler in {0}().

# ConsoleView_Appearence_OptionsForegroundWhite
source: White Option Labels
de: Weiße Optionsbeschriftung

# ConsoleView_Appearence_OptionsForegroundWhite_ToolTip
source: White Labels in Settings Area?
de: Weiße Beschriftungen im Einstellungsbereich?
